tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

brew "openssl@3"
brew "pcre"
brew "readline"
brew "sqlite"
brew "aircrack-ng"
brew "xz"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "bzip2"
brew "protobuf"
brew "python@3.12"
brew "llvm"
brew "apr-util"
brew "gettext"
brew "libssh2"
brew "aria2"
brew "automake"
brew "awk"
brew "bat"
brew "berkeley-db", link: true
brew "libusb"
brew "bettercap"
brew "json-c"
brew "bind"
brew "boost"
brew "glib"
brew "gcc"
brew "check"
brew "clamav"
brew "clang-format"
brew "cmake"
brew "cmake-docs"
brew "colordiff"
brew "coreutils"
brew "cpanminus"
brew "cppunit"
brew "rtmpdump"
brew "curl"
brew "node"
brew "eslint"
brew "exiftool"
brew "fd"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libssh"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "ffsend"
brew "freetds"
brew "fzf"
brew "gcovr"
brew "geos"
brew "libgcrypt"
brew "gnupg"
brew "krb5"
brew "proj"
brew "libxml2"
brew "gdal"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "glslang"
brew "gobject-introspection"
brew "jasper"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "guile"
brew "hcxtools"
brew "htop"
brew "httpd"
brew "hunspell"
brew "imagemagick"
brew "innoextract"
brew "openjdk"
brew "jruby"
brew "jupyterlab"
brew "keystone"
brew "perl"
brew "latexindent"
brew "libfido2"
brew "libproxy"
brew "libxslt"
brew "libzip"
brew "llvm@17"
brew "lynis"
brew "make"
brew "mas"
brew "zlib"
brew "mysql"
brew "neovim"
brew "netcat"
brew "nghttp2"
brew "nikto"
brew "nmap"
brew "qt"
brew "opencv"
brew "openssl@1.1"
brew "pdfgrep"
brew "php"
brew "pipx"
brew "pnpm"
brew "postgresql@16", restart_service: true
brew "protobuf@3"
brew "pure"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python-lxml"
brew "python@3.11"
brew "python@3.9"
brew "qemu"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "sfcgal"
brew "shfmt"
brew "telnet"
brew "tmux"
brew "tree"
brew "wget"
brew "wimlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zshdb"

cask "1password"
cask "1password-cli"
cask "alfred"
cask "appcleaner"
cask "bankid"
cask "brave-browser"
cask "cyberduck"
cask "daisydisk"
cask "db-browser-for-sqlite"
cask "etrecheckpro"
cask "flux"
cask "font-hack-nerd-font"
cask "haptic-touch-bar"
cask "inkscape"
cask "iterm2"
cask "kicad"
cask "knockknock"
cask "launchcontrol"
cask "little-snitch"
cask "mactex"
cask "micro-snitch"
cask "mullvadvpn"
cask "onionshare"
cask "plex-media-server"
cask "taskexplorer"
cask "the-unarchiver"
cask "tor-browser"
cask "transmission"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
