# Essential command line tools
brew "git"
brew "git-lfs"
brew "curl"
brew "wget"
brew "zsh"
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "grep"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "jq"
brew "tree"
brew "bat"
brew "eza"
brew "htop"

# Development tools
brew "neovim"
brew "tmux"

# Languages and package managers
brew "node"
brew "python"
brew "uv"
