tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"

# Essential command line tools
brew "git"
brew "curl"
brew "wget"
brew "zsh"
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "grep"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "jq"
brew "tree"

# Development tools
brew "neovim"
brew "tmux"

# Languages and package managers
brew "node"
brew "python"

# Essential GUI applications
cask "kitty"
